rnd-southerniot/rak4630-e-ink-claude/firmware/sdkconfig.defaults
# ── Base platform parity (ported from careflow-modbus-node) ───────────────────────────────────────
# senseflow-eink-node: ESP32-S3 (RAK3312) + SX1262, ESP-IDF v5.5.4 single canonical path.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Console: the RAK3312 native USB enumerates as the ESP32-S3 USB-Serial-JTAG controller (same path
# esptool flashes over) — required for the esp> provisioning console (P3). NOT USB-CDC/TinyUSB.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# 1 kHz FreeRTOS tick — required for RadioLib LoRaWAN TxDone timing (P2); the 100 Hz default
# undershoots the 10 ms scanGuard → RADIOLIB_ERR_TX_TIMEOUT. (careflow Phase-5 finding.)
CONFIG_FREERTOS_HZ=1000

# Resilience: Task-WDT initialised at boot (field task subscribes/feeds it in P3+); brownout at the
# IDF ESP32-S3 default level so a sagging rail forces a clean, logged reset.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# OTA: dual-slot partition table + bootloader app rollback (nvs pinned at 0x9000 in partitions.csv
# so provisioning + LoRaWAN nonces survive layout/OTA changes — no full erase).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM: Octal. Confirmed on board 3c:dc:75:6f:80:e4 via esptool — "Embedded PSRAM 8MB (AP_3v3)" =
# 8 MB Octal PSRAM @ 3.3 V (same S3R8-class SKU as careflow). No 8 MB Quad SKU exists.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# ──────────────────────────────────────────────────────────────────────────────────────────────────

CONFIG_APP_GATE=1
CONFIG_APP_GATE_ID_SCHEME_NEW=y
CONFIG_APP_GATE_TICK_MS=200
CONFIG_APP_GATE_IDLE_LOG_SEC=10
CONFIG_APP_GATE_SAMPLE_PERIOD_MS=1000
CONFIG_APP_GATE_UPLINK_PERIOD_MS=1000
CONFIG_APP_GATE6_BACKEND_ENABLE_DELAY_MS=8000
CONFIG_APP_HEARTBEAT_GPIO=46
CONFIG_APP_I2C_PORT=0
CONFIG_APP_I2C_SDA_GPIO=9
CONFIG_APP_I2C_SCL_GPIO=40
CONFIG_APP_I2C_FREQ_HZ=100000
CONFIG_APP_SGP40_ADDR=0x59
CONFIG_APP_BMP280_ADDR=0x76
CONFIG_APP_GATE2P1_EXPECTED_DEVICES=1
CONFIG_APP_GATE3_EXPECTED_DEVICES=1
CONFIG_APP_GATE4_EXPECTED_DEVICES=1
CONFIG_APP_GATE9_EXPECTED_DEVICES=1
CONFIG_APP_SAMPLE_PERIOD_SEC=300
CONFIG_APP_UPLINK_PERIOD_SEC=300
CONFIG_APP_DISPLAY_MIN_REFRESH_SEC=30
CONFIG_APP_REFRESH_VOC_DELTA_X100=300
CONFIG_APP_REFRESH_PRESSURE_DELTA_PA=50
CONFIG_APP_REFRESH_TEMP_DELTA_CENTI_C=50
CONFIG_APP_DISPLAY_LANDSCAPE=y
CONFIG_APP_DISPLAY_PANEL_PROFILE_SSD1680_250X122=y
CONFIG_APP_DISPLAY_SPI_HOST=2
CONFIG_APP_DISPLAY_SPI_MHZ=4
CONFIG_APP_DISPLAY_PIN_MOSI=11
CONFIG_APP_DISPLAY_PIN_MISO=-1
CONFIG_APP_DISPLAY_PIN_SCLK=13
CONFIG_APP_DISPLAY_PIN_CS=12
CONFIG_APP_DISPLAY_PIN_DC=21
CONFIG_APP_DISPLAY_PIN_RST=-1
CONFIG_APP_DISPLAY_PIN_BUSY=42
CONFIG_APP_DISPLAY_PIN_PWR=14
CONFIG_APP_DISPLAY_XRAM_OFFSET=0
CONFIG_APP_LORAWAN_BACKEND_ACTIVE=y
CONFIG_APP_LORAWAN_JOIN_BACKOFF_MS=5000
CONFIG_APP_LORAWAN_JOIN_SUCCESS_DELAY_MS=4000
